# Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

list1 = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
stringi = "йцу"
count = 0
if list1.count(stringi) < 2:
    count = -1
else:
    for i in range(len(list1)):
        if list1[i] == stringi:
            count += 1
            if count == 2:
                count = i
                break
print(f'второе вхождение строки {stringi} на позиции {count}')
