# Дана последовательность чисел. Получить список неповторяющихся 
# элементов исходной последовательности
# Пример: [1, 2, 3, 5, 1, 5, 3, 10] => [1, 2, 3, 5, 10]
list = [1, 2, 3, 5, 1, 5, 3, 10, 15,10]
list2 = []
new = set(list)
for i in new:
    list2.append(i)
print(f'{list} => {list2}')
